brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
// 2k SRAM
#define AUX_RAM_O_BANK0240                                          0x000003C0

// 2k SRAM
#define AUX_RAM_O_BANK0241                                          0x000003C4

// 2k SRAM
#define AUX_RAM_O_BANK0242                                          0x000003C8

// 2k SRAM
#define AUX_RAM_O_BANK0243                                          0x000003CC

// 2k SRAM
#define AUX_RAM_O_BANK0244                                          0x000003D0

// 2k SRAM
#define AUX_RAM_O_BANK0245                                          0x000003D4

// 2k SRAM
#define AUX_RAM_O_BANK0246                                          0x000003D8

// 2k SRAM
#define AUX_RAM_O_BANK0247                                          0x000003DC

// 2k SRAM
#define AUX_RAM_O_BANK0248                                          0x000003E0

// 2k SRAM
#define AUX_RAM_O_BANK0249                                          0x000003E4

// 2k SRAM
#define AUX_RAM_O_BANK0250                                          0x000003E8

// 2k SRAM
#define AUX_RAM_O_BANK0251                                          0x000003EC

// 2k SRAM
#define AUX_RAM_O_BANK0252                                          0x000003F0

// 2k SRAM
#define AUX_RAM_O_BANK0253                                          0x000003F4

// 2k SRAM
#define AUX_RAM_O_BANK0254                                          0x000003F8

// 2k SRAM
#define AUX_RAM_O_BANK0255                                          0x000003FC

// 2k SRAM
#define AUX_RAM_O_BANK0256                                          0x00000400

// 2k SRAM
#define AUX_RAM_O_BANK0257                                          0x00000404

// 2k SRAM
#define AUX_RAM_O_BANK0258                                          0x00000408

// 2k SRAM
#define AUX_RAM_O_BANK0259                                          0x0000040C

// 2k SRAM
#define AUX_RAM_O_BANK0260                                          0x00000410

// 2k SRAM
#define AUX_RAM_O_BANK0261                                          0x00000414

// 2k SRAM
#define AUX_RAM_O_BANK0262                                          0x00000418

// 2k SRAM
#define AUX_RAM_O_BANK0263                                          0x0000041C

// 2k SRAM
#define AUX_RAM_O_BANK0264                                          0x00000420

// 2k SRAM
#define AUX_RAM_O_BANK0265                                          0x00000424

// 2k SRAM
#define AUX_RAM_O_BANK0266                                          0x00000428

// 2k SRAM
#define AUX_RAM_O_BANK0267                                          0x0000042C

// 2k SRAM
#define AUX_RAM_O_BANK0268                                          0x00000430

// 2k SRAM
#define AUX_RAM_O_BANK0269                                          0x00000434

// 2k SRAM
#define AUX_RAM_O_BANK0270                                          0x00000438

// 2k SRAM
#define AUX_RAM_O_BANK0271                                          0x0000043C

// 2k SRAM
#define AUX_RAM_O_BANK0272                                          0x00000440

// 2k SRAM
#define AUX_RAM_O_BANK0273                                          0x00000444

// 2k SRAM
#define AUX_RAM_O_BANK0274                                          0x00000448

// 2k SRAM
#define AUX_RAM_O_BANK0275                                          0x0000044C

// 2k SRAM
#define AUX_RAM_O_BANK0276                                          0x00000450

// 2k SRAM
#define AUX_RAM_O_BANK0277                                          0x00000454

// 2k SRAM
#define AUX_RAM_O_BANK0278                                          0x00000458

// 2k SRAM
#define AUX_RAM_O_BANK0279                                          0x0000045C

// 2k SRAM
#define AUX_RAM_O_BANK0280                                          0x00000460

// 2k SRAM
#define AUX_RAM_O_BANK0281                                          0x00000464

// 2k SRAM
#define AUX_RAM_O_BANK0282                                          0x00000468

// 2k SRAM
#define AUX_RAM_O_BANK0283                                          0x0000046C

// 2k SRAM
#define AUX_RAM_O_BANK0284                                          0x00000470

// 2k SRAM
#define AUX_RAM_O_BANK0285                                          0x00000474

// 2k SRAM
#define AUX_RAM_O_BANK0286                                          0x00000478

// 2k SRAM
#define AUX_RAM_O_BANK0287                                          0x0000047C

// 2k SRAM
#define AUX_RAM_O_BANK0288                                          0x00000480

// 2k SRAM
#define AUX_RAM_O_BANK0289                                          0x00000484

// 2k SRAM
#define AUX_RAM_O_BANK0290                                          0x00000488

// 2k SRAM
#define AUX_RAM_O_BANK0291                                          0x0000048C

// 2k SRAM
#define AUX_RAM_O_BANK0292                                          0x00000490

// 2k SRAM
#define AUX_RAM_O_BANK0293                                          0x00000494

// 2k SRAM
#define AUX_RAM_O_BANK0294                                          0x00000498

// 2k SRAM
#define AUX_RAM_O_BANK0295                                          0x0000049C

// 2k SRAM
#define AUX_RAM_O_BANK0296                                          0x000004A0

// 2k SRAM
#define AUX_RAM_O_BANK0297                                          0x000004A4

// 2k SRAM
#define AUX_RAM_O_BANK0298                                          0x000004A8

// 2k SRAM
#define AUX_RAM_O_BANK0299                                          0x000004AC

// 2k SRAM
#define AUX_RAM_O_BANK0300                                          0x000004B0

// 2k SRAM
#define AUX_RAM_O_BANK0301                                          0x000004B4

// 2k SRAM
#define AUX_RAM_O_BANK0302                                          0x000004B8

// 2k SRAM
#define AUX_RAM_O_BANK0303                                          0x000004BC

// 2k SRAM
#define AUX_RAM_O_BANK0304                                          0x000004C0

// 2k SRAM
#define AUX_RAM_O_BANK0305                                          0x000004C4

// 2k SRAM
#define AUX_RAM_O_BANK0306                                          0x000004C8

// 2k SRAM
#define AUX_RAM_O_BANK0307                                          0x000004CC

// 2k SRAM
#define AUX_RAM_O_BANK0308                                          0x000004D0

// 2k SRAM
#define AUX_RAM_O_BANK0309                                          0x000004D4

// 2k SRAM
#define AUX_RAM_O_BANK0310                                          0x000004D8

// 2k SRAM
#define AUX_RAM_O_BANK0311                                          0x000004DC

// 2k SRAM
#define AUX_RAM_O_BANK0312                                          0x000004E0

// 2k SRAM
#define AUX_RAM_O_BANK0313                                          0x000004E4

// 2k SRAM
#define AUX_RAM_O_BANK0314                                          0x000004E8

// 2k SRAM
#define AUX_RAM_O_BANK0315                                          0x000004EC

// 2k SRAM
#define AUX_RAM_O_BANK0316                                          0x000004F0

// 2k SRAM
#define AUX_RAM_O_BANK0317                                          0x000004F4

// 2k SRAM
#define AUX_RAM_O_BANK0318                                          0x000004F8

// 2k SRAM
#define AUX_RAM_O_BANK0319                                          0x000004FC

// 2k SRAM
#define AUX_RAM_O_BANK0320                                          0x00000500

// 2k SRAM
#define AUX_RAM_O_BANK0321                                          0x00000504

// 2k SRAM
#define AUX_RAM_O_BANK0322                                          0x00000508

// 2k SRAM
#define AUX_RAM_O_BANK0323                                          0x0000050C

// 2k SRAM
#define AUX_RAM_O_BANK0324                                          0x00000510

// 2k SRAM
#define AUX_RAM_O_BANK0325                                          0x00000514

// 2k SRAM
#define AUX_RAM_O_BANK0326                                          0x00000518

// 2k SRAM
#define AUX_RAM_O_BANK0327                                          0x0000051C

// 2k SRAM
#define AUX_RAM_O_BANK0328                                          0x00000520

// 2k SRAM
#define AUX_RAM_O_BANK0329                                          0x00000524

// 2k SRAM
#define AUX_RAM_O_BANK0330                                          0x00000528

// 2k SRAM
#define AUX_RAM_O_BANK0331                                          0x0000052C

// 2k SRAM
#define AUX_RAM_O_BANK0332                                          0x00000530

// 2k SRAM
#define AUX_RAM_O_BANK0333                                          0x00000534

// 2k SRAM
#define AUX_RAM_O_BANK0334                                          0x00000538

// 2k SRAM
#define AUX_RAM_O_BANK0335                                          0x0000053C

// 2k SRAM
#define AUX_RAM_O_BANK0336                                          0x00000540

// 2k SRAM
#define AUX_RAM_O_BANK0337                                          0x00000544

// 2k SRAM
#define AUX_RAM_O_BANK0338                                          0x00000548

// 2k SRAM
#define AUX_RAM_O_BANK0339                                          0x0000054C

// 2k SRAM
#define AUX_RAM_O_BANK0340                                          0x00000550

// 2k SRAM
#define AUX_RAM_O_BANK0341                                          0x00000554

// 2k SRAM
#define AUX_RAM_O_BANK0342                                          0x00000558

// 2k SRAM
#define AUX_RAM_O_BANK0343                                          0x0000055C

// 2k SRAM
#define AUX_RAM_O_BANK0344                                          0x00000560

// 2k SRAM
#define AUX_RAM_O_BANK0345                                          0x00000564

// 2k SRAM
#define AUX_RAM_O_BANK0346                                          0x00000568

// 2k SRAM
#define AUX_RAM_O_BANK0347                                          0x0000056C

// 2k SRAM
#define AUX_RAM_O_BANK0348                                          0x00000570

// 2k SRAM
#define AUX_RAM_O_BANK0349                                          0x00000574

// 2k SRAM
#define AUX_RAM_O_BANK0350                                          0x00000578

// 2k SRAM
#define AUX_RAM_O_BANK0351                                          0x0000057C

// 2k SRAM
#define AUX_RAM_O_BANK0352                                          0x00000580

// 2k SRAM
#define AUX_RAM_O_BANK0353                                          0x00000584

// 2k SRAM
#define AUX_RAM_O_BANK0354                                          0x00000588

// 2k SRAM
#define AUX_RAM_O_BANK0355                                          0x0000058C

// 2k SRAM
#define AUX_RAM_O_BANK0356                                          0x00000590

// 2k SRAM
#define AUX_RAM_O_BANK0357                                          0x00000594

// 2k SRAM
#define AUX_RAM_O_BANK0358                                          0x00000598

// 2k SRAM
#define AUX_RAM_O_BANK0359                                          0x0000059C

// 2k SRAM
#define AUX_RAM_O_BANK0360                                          0x000005A0

// 2k SRAM
#define AUX_RAM_O_BANK0361                                          0x000005A4

// 2k SRAM
#define AUX_RAM_O_BANK0362                                          0x000005A8

// 2k SRAM
#define AUX_RAM_O_BANK0363                                          0x000005AC

// 2k SRAM
#define AUX_RAM_O_BANK0364                                          0x000005B0

// 2k SRAM
#define AUX_RAM_O_BANK0365                                          0x000005B4

// 2k SRAM
#define AUX_RAM_O_BANK0366                                          0x000005B8

// 2k SRAM
#define AUX_RAM_O_BANK0367                                          0x000005BC

// 2k SRAM
#define AUX_RAM_O_BANK0368                                          0x000005C0

// 2k SRAM
#define AUX_RAM_O_BANK0369                                          0x000005C4

// 2k SRAM
#define AUX_RAM_O_BANK0370                                          0x000005C8

// 2k SRAM
#define AUX_RAM_O_BANK0371                                          0x000005CC

// 2k SRAM
#define AUX_RAM_O_BANK0372                                          0x000005D0

// 2k SRAM
#define AUX_RAM_O_BANK0373                                          0x000005D4

// 2k SRAM
#define AUX_RAM_O_BANK0374                                          0x000005D8

// 2k SRAM
#define AUX_RAM_O_BANK0375                                          0x000005DC

// 2k SRAM
#define AUX_RAM_O_BANK0376                                          0x000005E0

// 2k SRAM
#define AUX_RAM_O_BANK0377                                          0x000005E4

// 2k SRAM
#define AUX_RAM_O_BANK0378                                          0x000005E8

// 2k SRAM
#define AUX_RAM_O_BANK0379                                          0x000005EC

// 2k SRAM
#define AUX_RAM_O_BANK0380                                          0x000005F0

// 2k SRAM
#define AUX_RAM_O_BANK0381                                          0x000005F4

// 2k SRAM
#define AUX_RAM_O_BANK0382                                          0x000005F8

// 2k SRAM
#define AUX_RAM_O_BANK0383                                          0x000005FC

// 2k SRAM
#define AUX_RAM_O_BANK0384                                          0x00000600

// 2k SRAM
#define AUX_RAM_O_BANK0385                                          0x00000604

// 2k SRAM
#define AUX_RAM_O_BANK0386                                          0x00000608

// 2k SRAM
#define AUX_RAM_O_BANK0387                                          0x0000060C

// 2k SRAM
#define AUX_RAM_O_BANK0388                                          0x00000610

// 2k SRAM
#define AUX_RAM_O_BANK0389                                          0x00000614

// 2k SRAM
#define AUX_RAM_O_BANK0390                                          0x00000618

// 2k SRAM
#define AUX_RAM_O_BANK0391                                          0x0000061C

// 2k SRAM
#define AUX_RAM_O_BANK0392                                          0x00000620

// 2k SRAM
#define AUX_RAM_O_BANK0393                                          0x00000624

// 2k SRAM
#define AUX_RAM_O_BANK0394                                          0x00000628

// 2k SRAM
#define AUX_RAM_O_BANK0395                                          0x0000062C

// 2k SRAM
#define AUX_RAM_O_BANK0396                                          0x00000630

// 2k SRAM
#define AUX_RAM_O_BANK0397                                          0x00000634

// 2k SRAM
#define AUX_RAM_O_BANK0398                                          0x00000638

// 2k SRAM
#define AUX_RAM_O_BANK0399                                          0x0000063C

// 2k SRAM
#define AUX_RAM_O_BANK0400                                          0x00000640

// 2k SRAM
#define AUX_RAM_O_BANK0401                                          0x00000644

// 2k SRAM
#define AUX_RAM_O_BANK0402                                          0x00000648

// 2k SRAM
#define AUX_RAM_O_BANK0403                                          0x0000064C

// 2k SRAM
#define AUX_RAM_O_BANK0404                                          0x00000650

// 2k SRAM
#define AUX_RAM_O_BANK0405                                          0x00000654

// 2k SRAM
#define AUX_RAM_O_BANK0406                                          0x00000658

// 2k SRAM
#define AUX_RAM_O_BANK0407                                          0x0000065C

// 2k SRAM
#define AUX_RAM_O_BANK0408                                          0x00000660

// 2k SRAM
#define AUX_RAM_O_BANK0409                                          0x00000664

// 2k SRAM
#define AUX_RAM_O_BANK0410                                          0x00000668

// 2k SRAM
#define AUX_RAM_O_BANK0411                                          0x0000066C

// 2k SRAM
#define AUX_RAM_O_BANK0412                                          0x00000670

// 2k SRAM
#define AUX_RAM_O_BANK0413                                          0x00000674

// 2k SRAM
#define AUX_RAM_O_BANK0414                                          0x00000678

// 2k SRAM
#define AUX_RAM_O_BANK0415                                          0x0000067C

// 2k SRAM
#define AUX_RAM_O_BANK0416                                          0x00000680

// 2k SRAM
#define AUX_RAM_O_BANK0417                                          0x00000684

// 2k SRAM
#define AUX_RAM_O_BANK0418                                          0x00000688

// 2k SRAM
#define AUX_RAM_O_BANK0419                                          0x0000068C

// 2k SRAM
#define AUX_RAM_O_BANK0420                                          0x00000690

// 2k SRAM
#define AUX_RAM_O_BANK0421                                          0x00000694

// 2k SRAM
#define AUX_RAM_O_BANK0422                                          0x00000698

// 2k SRAM
#define AUX_RAM_O_BANK0423                                          0x0000069C

// 2k SRAM
#define AUX_RAM_O_BANK0424                                          0x000006A0

// 2k SRAM
#define AUX_RAM_O_BANK0425                                          0x000006A4

// 2k SRAM
#define AUX_RAM_O_BANK0426                                          0x000006A8

// 2k SRAM
#define AUX_RAM_O_BANK0427                                          0x000006AC

// 2k SRAM
#define AUX_RAM_O_BANK0428                                          0x000006B0

// 2k SRAM
#define AUX_RAM_O_BANK0429                                          0x000006B4

// 2k SRAM
#define AUX_RAM_O_BANK0430                                          0x000006B8

// 2k SRAM
#define AUX_RAM_O_BANK0431                                          0x000006BC

// 2k SRAM
#define AUX_RAM_O_BANK0432                                          0x000006C0

// 2k SRAM
#define AUX_RAM_O_BANK0433                                          0x000006C4

// 2k SRAM
#define AUX_RAM_O_BANK0434                                          0x000006C8

// 2k SRAM
#define AUX_RAM_O_BANK0435                                          0x000006CC

// 2k SRAM
#define AUX_RAM_O_BANK0436                                          0x000006D0

// 2k SRAM
#define AUX_RAM_O_BANK0437                                          0x000006D4

// 2k SRAM
#define AUX_RAM_O_BANK0438                                          0x000006D8

// 2k SRAM
#define AUX_RAM_O_BANK0439                                          0x000006DC

// 2k SRAM
#define AUX_RAM_O_BANK0440                                          0x000006E0

// 2k SRAM
#define AUX_RAM_O_BANK0441                                          0x000006E4

// 2k SRAM
#define AUX_RAM_O_BANK0442                                          0x000006E8

// 2k SRAM
#define AUX_RAM_O_BANK0443                                          0x000006EC

// 2k SRAM
#define AUX_RAM_O_BANK0444                                          0x000006F0

// 2k SRAM
#define AUX_RAM_O_BANK0445                                          0x000006F4

// 2k SRAM
#define AUX_RAM_O_BANK0446                                          0x000006F8

// 2k SRAM
#define AUX_RAM_O_BANK0447                                          0x000006FC

// 2k SRAM
#define AUX_RAM_O_BANK0448                                          0x00000700

// 2k SRAM
#define AUX_RAM_O_BANK0449                                          0x00000704

// 2k SRAM
#define AUX_RAM_O_BANK0450                                          0x00000708

// 2k SRAM
#define AUX_RAM_O_BANK0451                                          0x0000070C

// 2k SRAM
#define AUX_RAM_O_BANK0452                                          0x00000710

// 2k SRAM
#define AUX_RAM_O_BANK0453                                          0x00000714

// 2k SRAM
#define AUX_RAM_O_BANK0454                                          0x00000718

// 2k SRAM
#define AUX_RAM_O_BANK0455                                          0x0000071C

// 2k SRAM
#define AUX_RAM_O_BANK0456                                          0x00000720

// 2k SRAM
#define AUX_RAM_O_BANK0457                                          0x00000724

// 2k SRAM
#define AUX_RAM_O_BANK0458                                          0x00000728

// 2k SRAM
#define AUX_RAM_O_BANK0459                                          0x0000072C

// 2k SRAM
#define AUX_RAM_O_BANK0460                                          0x00000730

// 2k SRAM
#define AUX_RAM_O_BANK0461                                          0x00000734

// 2k SRAM
#define AUX_RAM_O_BANK0462                                          0x00000738

// 2k SRAM
#define AUX_RAM_O_BANK0463                                          0x0000073C

// 2k SRAM
#define AUX_RAM_O_BANK0464                                          0x00000740

// 2k SRAM
#define AUX_RAM_O_BANK0465                                          0x00000744

// 2k SRAM
#define AUX_RAM_O_BANK0466                                          0x00000748

// 2k SRAM
#define AUX_RAM_O_BANK0467                                          0x0000074C

// 2k SRAM
#define AUX_RAM_O_BANK0468                                          0x00000750

// 2k SRAM
#define AUX_RAM_O_BANK0469                                          0x00000754

// 2k SRAM
#define AUX_RAM_O_BANK0470                                          0x00000758

// 2k SRAM
#define AUX_RAM_O_BANK0471                                          0x0000075C

// 2k SRAM
#define AUX_RAM_O_BANK0472                                          0x00000760

// 2k SRAM
#define AUX_RAM_O_BANK0473                                          0x00000764

// 2k SRAM
#define AUX_RAM_O_BANK0474                                          0x00000768

// 2k SRAM
#define AUX_RAM_O_BANK0475                                          0x0000076C

// 2k SRAM
#define AUX_RAM_O_BANK0476                                          0x00000770

// 2k SRAM
#define AUX_RAM_O_BANK0477                                          0x00000774

// 2k SRAM
#define AUX_RAM_O_BANK0478                                          0x00000778

// 2k SRAM
#define AUX_RAM_O_BANK0479                                          0x0000077C

// 2k SRAM
#define AUX_RAM_O_BANK0480                                          0x00000780

// 2k SRAM
#define AUX_RAM_O_BANK0481                                          0x00000784

// 2k SRAM
#define AUX_RAM_O_BANK0482                                          0x00000788

// 2k SRAM
#define AUX_RAM_O_BANK0483                                          0x0000078C

// 2k SRAM
#define AUX_RAM_O_BANK0484                                          0x00000790

// 2k SRAM
#define AUX_RAM_O_BANK0485                                          0x00000794

// 2k SRAM
#define AUX_RAM_O_BANK0486                                          0x00000798

// 2k SRAM
#define AUX_RAM_O_BANK0487                                          0x0000079C

// 2k SRAM
#define AUX_RAM_O_BANK0488                                          0x000007A0

// 2k SRAM
#define AUX_RAM_O_BANK0489                                          0x000007A4

// 2k SRAM
#define AUX_RAM_O_BANK0490                                          0x000007A8

// 2k SRAM
#define AUX_RAM_O_BANK0491                                          0x000007AC

// 2k SRAM
#define AUX_RAM_O_BANK0492                                          0x000007B0

// 2k SRAM
#define AUX_RAM_O_BANK0493                                          0x000007B4

// 2k SRAM
#define AUX_RAM_O_BANK0494                                          0x000007B8

// 2k SRAM
#define AUX_RAM_O_BANK0495                                          0x000007BC

// 2k SRAM
#define AUX_RAM_O_BANK0496                                          0x000007C0

// 2k SRAM
#define AUX_RAM_O_BANK0497                                          0x000007C4

// 2k SRAM
#define AUX_RAM_O_BANK0498                                          0x000007C8

// 2k SRAM
#define AUX_RAM_O_BANK0499                                          0x000007CC

// 2k SRAM
#define AUX_RAM_O_BANK0500                                          0x000007D0

// 2k SRAM
#define AUX_RAM_O_BANK0501                                          0x000007D4

// 2k SRAM
#define AUX_RAM_O_BANK0502                                          0x000007D8

