brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
// 2k SRAM
#define AUX_RAM_O_BANK0503                                          0x000007DC

// 2k SRAM
#define AUX_RAM_O_BANK0504                                          0x000007E0

// 2k SRAM
#define AUX_RAM_O_BANK0505                                          0x000007E4

// 2k SRAM
#define AUX_RAM_O_BANK0506                                          0x000007E8

// 2k SRAM
#define AUX_RAM_O_BANK0507                                          0x000007EC

// 2k SRAM
#define AUX_RAM_O_BANK0508                                          0x000007F0

// 2k SRAM
#define AUX_RAM_O_BANK0509                                          0x000007F4

// 2k SRAM
#define AUX_RAM_O_BANK0510                                          0x000007F8

// 2k SRAM
#define AUX_RAM_O_BANK0511                                          0x000007FC

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK00
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK00_DATA_W                                               32
#define AUX_RAM_BANK00_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK00_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK01
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK01_DATA_W                                               32
#define AUX_RAM_BANK01_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK01_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK02
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK02_DATA_W                                               32
#define AUX_RAM_BANK02_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK02_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK03
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK03_DATA_W                                               32
#define AUX_RAM_BANK03_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK03_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK04
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK04_DATA_W                                               32
#define AUX_RAM_BANK04_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK04_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK05
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK05_DATA_W                                               32
#define AUX_RAM_BANK05_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK05_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK06
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK06_DATA_W                                               32
#define AUX_RAM_BANK06_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK06_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK07
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK07_DATA_W                                               32
#define AUX_RAM_BANK07_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK07_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK08
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK08_DATA_W                                               32
#define AUX_RAM_BANK08_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK08_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK09
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK09_DATA_W                                               32
#define AUX_RAM_BANK09_DATA_M                                       0xFFFFFFFF
#define AUX_RAM_BANK09_DATA_S                                                0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK010
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK010_DATA_W                                              32
#define AUX_RAM_BANK010_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK010_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK011
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK011_DATA_W                                              32
#define AUX_RAM_BANK011_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK011_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK012
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK012_DATA_W                                              32
#define AUX_RAM_BANK012_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK012_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK013
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK013_DATA_W                                              32
#define AUX_RAM_BANK013_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK013_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK014
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK014_DATA_W                                              32
#define AUX_RAM_BANK014_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK014_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK015
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK015_DATA_W                                              32
#define AUX_RAM_BANK015_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK015_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK016
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK016_DATA_W                                              32
#define AUX_RAM_BANK016_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK016_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK017
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK017_DATA_W                                              32
#define AUX_RAM_BANK017_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK017_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK018
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK018_DATA_W                                              32
#define AUX_RAM_BANK018_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK018_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK019
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK019_DATA_W                                              32
#define AUX_RAM_BANK019_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK019_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK020
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK020_DATA_W                                              32
#define AUX_RAM_BANK020_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK020_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK021
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK021_DATA_W                                              32
#define AUX_RAM_BANK021_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK021_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK022
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK022_DATA_W                                              32
#define AUX_RAM_BANK022_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK022_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK023
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK023_DATA_W                                              32
#define AUX_RAM_BANK023_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK023_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK024
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK024_DATA_W                                              32
#define AUX_RAM_BANK024_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK024_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK025
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK025_DATA_W                                              32
#define AUX_RAM_BANK025_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK025_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK026
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK026_DATA_W                                              32
#define AUX_RAM_BANK026_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK026_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK027
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK027_DATA_W                                              32
#define AUX_RAM_BANK027_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK027_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK028
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK028_DATA_W                                              32
#define AUX_RAM_BANK028_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK028_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK029
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK029_DATA_W                                              32
#define AUX_RAM_BANK029_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK029_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK030
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK030_DATA_W                                              32
#define AUX_RAM_BANK030_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK030_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK031
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK031_DATA_W                                              32
#define AUX_RAM_BANK031_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK031_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK032
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK032_DATA_W                                              32
#define AUX_RAM_BANK032_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK032_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK033
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK033_DATA_W                                              32
#define AUX_RAM_BANK033_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK033_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK034
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK034_DATA_W                                              32
#define AUX_RAM_BANK034_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK034_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK035
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK035_DATA_W                                              32
#define AUX_RAM_BANK035_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK035_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK036
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK036_DATA_W                                              32
#define AUX_RAM_BANK036_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK036_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK037
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK037_DATA_W                                              32
#define AUX_RAM_BANK037_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK037_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK038
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK038_DATA_W                                              32
#define AUX_RAM_BANK038_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK038_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK039
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK039_DATA_W                                              32
#define AUX_RAM_BANK039_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK039_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK040
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK040_DATA_W                                              32
#define AUX_RAM_BANK040_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK040_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK041
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK041_DATA_W                                              32
#define AUX_RAM_BANK041_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK041_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK042
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK042_DATA_W                                              32
#define AUX_RAM_BANK042_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK042_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK043
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK043_DATA_W                                              32
#define AUX_RAM_BANK043_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK043_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK044
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK044_DATA_W                                              32
#define AUX_RAM_BANK044_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK044_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK045
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK045_DATA_W                                              32
#define AUX_RAM_BANK045_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK045_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK046
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK046_DATA_W                                              32
#define AUX_RAM_BANK046_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK046_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK047
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK047_DATA_W                                              32
#define AUX_RAM_BANK047_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK047_DATA_S                                               0

