brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
//*****************************************************************************
//
// Register: AUX_RAM_O_BANK048
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK048_DATA_W                                              32
#define AUX_RAM_BANK048_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK048_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK049
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK049_DATA_W                                              32
#define AUX_RAM_BANK049_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK049_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK050
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK050_DATA_W                                              32
#define AUX_RAM_BANK050_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK050_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK051
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK051_DATA_W                                              32
#define AUX_RAM_BANK051_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK051_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK052
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK052_DATA_W                                              32
#define AUX_RAM_BANK052_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK052_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK053
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK053_DATA_W                                              32
#define AUX_RAM_BANK053_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK053_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK054
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK054_DATA_W                                              32
#define AUX_RAM_BANK054_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK054_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK055
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK055_DATA_W                                              32
#define AUX_RAM_BANK055_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK055_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK056
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK056_DATA_W                                              32
#define AUX_RAM_BANK056_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK056_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK057
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK057_DATA_W                                              32
#define AUX_RAM_BANK057_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK057_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK058
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK058_DATA_W                                              32
#define AUX_RAM_BANK058_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK058_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK059
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK059_DATA_W                                              32
#define AUX_RAM_BANK059_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK059_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK060
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK060_DATA_W                                              32
#define AUX_RAM_BANK060_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK060_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK061
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK061_DATA_W                                              32
#define AUX_RAM_BANK061_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK061_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK062
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK062_DATA_W                                              32
#define AUX_RAM_BANK062_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK062_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK063
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK063_DATA_W                                              32
#define AUX_RAM_BANK063_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK063_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK064
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK064_DATA_W                                              32
#define AUX_RAM_BANK064_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK064_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK065
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK065_DATA_W                                              32
#define AUX_RAM_BANK065_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK065_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK066
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK066_DATA_W                                              32
#define AUX_RAM_BANK066_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK066_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK067
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK067_DATA_W                                              32
#define AUX_RAM_BANK067_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK067_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK068
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK068_DATA_W                                              32
#define AUX_RAM_BANK068_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK068_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK069
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK069_DATA_W                                              32
#define AUX_RAM_BANK069_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK069_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK070
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK070_DATA_W                                              32
#define AUX_RAM_BANK070_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK070_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK071
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK071_DATA_W                                              32
#define AUX_RAM_BANK071_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK071_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK072
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK072_DATA_W                                              32
#define AUX_RAM_BANK072_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK072_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK073
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK073_DATA_W                                              32
#define AUX_RAM_BANK073_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK073_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK074
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK074_DATA_W                                              32
#define AUX_RAM_BANK074_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK074_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK075
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK075_DATA_W                                              32
#define AUX_RAM_BANK075_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK075_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK076
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK076_DATA_W                                              32
#define AUX_RAM_BANK076_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK076_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK077
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK077_DATA_W                                              32
#define AUX_RAM_BANK077_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK077_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK078
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK078_DATA_W                                              32
#define AUX_RAM_BANK078_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK078_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK079
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK079_DATA_W                                              32
#define AUX_RAM_BANK079_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK079_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK080
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK080_DATA_W                                              32
#define AUX_RAM_BANK080_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK080_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK081
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK081_DATA_W                                              32
#define AUX_RAM_BANK081_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK081_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK082
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK082_DATA_W                                              32
#define AUX_RAM_BANK082_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK082_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK083
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK083_DATA_W                                              32
#define AUX_RAM_BANK083_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK083_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK084
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK084_DATA_W                                              32
#define AUX_RAM_BANK084_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK084_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK085
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK085_DATA_W                                              32
#define AUX_RAM_BANK085_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK085_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK086
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK086_DATA_W                                              32
#define AUX_RAM_BANK086_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK086_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK087
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK087_DATA_W                                              32
#define AUX_RAM_BANK087_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK087_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK088
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK088_DATA_W                                              32
#define AUX_RAM_BANK088_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK088_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK089
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK089_DATA_W                                              32
#define AUX_RAM_BANK089_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK089_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK090
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK090_DATA_W                                              32
#define AUX_RAM_BANK090_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK090_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK091
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK091_DATA_W                                              32
#define AUX_RAM_BANK091_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK091_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK092
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK092_DATA_W                                              32
#define AUX_RAM_BANK092_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK092_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK093
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK093_DATA_W                                              32
#define AUX_RAM_BANK093_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK093_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK094
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK094_DATA_W                                              32
#define AUX_RAM_BANK094_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK094_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK095
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK095_DATA_W                                              32
#define AUX_RAM_BANK095_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK095_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK096
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK096_DATA_W                                              32
#define AUX_RAM_BANK096_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK096_DATA_S                                               0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK097
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK097_DATA_W                                              32
#define AUX_RAM_BANK097_DATA_M                                      0xFFFFFFFF
#define AUX_RAM_BANK097_DATA_S                                               0

