brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0198_DATA_W                                             32
#define AUX_RAM_BANK0198_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0198_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0199_DATA_W                                             32
#define AUX_RAM_BANK0199_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0199_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0200
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0200_DATA_W                                             32
#define AUX_RAM_BANK0200_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0200_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0201
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0201_DATA_W                                             32
#define AUX_RAM_BANK0201_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0201_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0202
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0202_DATA_W                                             32
#define AUX_RAM_BANK0202_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0202_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0203
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0203_DATA_W                                             32
#define AUX_RAM_BANK0203_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0203_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0204
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0204_DATA_W                                             32
#define AUX_RAM_BANK0204_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0204_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0205
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0205_DATA_W                                             32
#define AUX_RAM_BANK0205_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0205_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0206
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0206_DATA_W                                             32
#define AUX_RAM_BANK0206_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0206_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0207
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0207_DATA_W                                             32
#define AUX_RAM_BANK0207_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0207_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0208
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0208_DATA_W                                             32
#define AUX_RAM_BANK0208_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0208_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0209
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0209_DATA_W                                             32
#define AUX_RAM_BANK0209_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0209_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0210
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0210_DATA_W                                             32
#define AUX_RAM_BANK0210_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0210_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0211
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0211_DATA_W                                             32
#define AUX_RAM_BANK0211_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0211_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0212
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0212_DATA_W                                             32
#define AUX_RAM_BANK0212_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0212_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0213
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0213_DATA_W                                             32
#define AUX_RAM_BANK0213_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0213_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0214
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0214_DATA_W                                             32
#define AUX_RAM_BANK0214_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0214_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0215
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0215_DATA_W                                             32
#define AUX_RAM_BANK0215_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0215_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0216
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0216_DATA_W                                             32
#define AUX_RAM_BANK0216_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0216_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0217
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0217_DATA_W                                             32
#define AUX_RAM_BANK0217_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0217_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0218
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0218_DATA_W                                             32
#define AUX_RAM_BANK0218_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0218_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0219
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0219_DATA_W                                             32
#define AUX_RAM_BANK0219_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0219_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0220
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0220_DATA_W                                             32
#define AUX_RAM_BANK0220_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0220_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0221
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0221_DATA_W                                             32
#define AUX_RAM_BANK0221_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0221_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0222
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0222_DATA_W                                             32
#define AUX_RAM_BANK0222_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0222_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0223
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0223_DATA_W                                             32
#define AUX_RAM_BANK0223_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0223_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0224
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0224_DATA_W                                             32
#define AUX_RAM_BANK0224_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0224_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0225
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0225_DATA_W                                             32
#define AUX_RAM_BANK0225_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0225_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0226
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0226_DATA_W                                             32
#define AUX_RAM_BANK0226_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0226_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0227
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0227_DATA_W                                             32
#define AUX_RAM_BANK0227_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0227_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0228
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0228_DATA_W                                             32
#define AUX_RAM_BANK0228_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0228_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0229
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0229_DATA_W                                             32
#define AUX_RAM_BANK0229_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0229_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0230
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0230_DATA_W                                             32
#define AUX_RAM_BANK0230_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0230_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0231
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0231_DATA_W                                             32
#define AUX_RAM_BANK0231_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0231_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0232
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0232_DATA_W                                             32
#define AUX_RAM_BANK0232_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0232_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0233
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0233_DATA_W                                             32
#define AUX_RAM_BANK0233_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0233_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0234
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0234_DATA_W                                             32
#define AUX_RAM_BANK0234_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0234_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0235
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0235_DATA_W                                             32
#define AUX_RAM_BANK0235_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0235_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0236
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0236_DATA_W                                             32
#define AUX_RAM_BANK0236_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0236_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0237
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0237_DATA_W                                             32
#define AUX_RAM_BANK0237_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0237_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0238
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0238_DATA_W                                             32
#define AUX_RAM_BANK0238_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0238_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0239
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0239_DATA_W                                             32
#define AUX_RAM_BANK0239_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0239_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0240
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0240_DATA_W                                             32
#define AUX_RAM_BANK0240_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0240_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0241
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0241_DATA_W                                             32
#define AUX_RAM_BANK0241_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0241_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0242
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0242_DATA_W                                             32
#define AUX_RAM_BANK0242_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0242_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0243
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0243_DATA_W                                             32
#define AUX_RAM_BANK0243_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0243_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0244
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0244_DATA_W                                             32
#define AUX_RAM_BANK0244_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0244_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0245
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0245_DATA_W                                             32
#define AUX_RAM_BANK0245_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0245_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0246
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0246_DATA_W                                             32
#define AUX_RAM_BANK0246_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0246_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0247
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0247_DATA_W                                             32
#define AUX_RAM_BANK0247_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0247_DATA_S                                              0

