brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0248
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0248_DATA_W                                             32
#define AUX_RAM_BANK0248_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0248_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0249
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0249_DATA_W                                             32
#define AUX_RAM_BANK0249_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0249_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0250
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0250_DATA_W                                             32
#define AUX_RAM_BANK0250_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0250_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0251
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0251_DATA_W                                             32
#define AUX_RAM_BANK0251_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0251_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0252
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0252_DATA_W                                             32
#define AUX_RAM_BANK0252_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0252_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0253
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0253_DATA_W                                             32
#define AUX_RAM_BANK0253_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0253_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0254
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0254_DATA_W                                             32
#define AUX_RAM_BANK0254_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0254_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0255
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0255_DATA_W                                             32
#define AUX_RAM_BANK0255_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0255_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0256
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0256_DATA_W                                             32
#define AUX_RAM_BANK0256_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0256_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0257
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0257_DATA_W                                             32
#define AUX_RAM_BANK0257_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0257_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0258
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0258_DATA_W                                             32
#define AUX_RAM_BANK0258_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0258_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0259
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0259_DATA_W                                             32
#define AUX_RAM_BANK0259_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0259_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0260
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0260_DATA_W                                             32
#define AUX_RAM_BANK0260_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0260_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0261
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0261_DATA_W                                             32
#define AUX_RAM_BANK0261_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0261_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0262
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0262_DATA_W                                             32
#define AUX_RAM_BANK0262_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0262_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0263
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0263_DATA_W                                             32
#define AUX_RAM_BANK0263_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0263_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0264
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0264_DATA_W                                             32
#define AUX_RAM_BANK0264_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0264_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0265
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0265_DATA_W                                             32
#define AUX_RAM_BANK0265_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0265_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0266
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0266_DATA_W                                             32
#define AUX_RAM_BANK0266_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0266_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0267
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0267_DATA_W                                             32
#define AUX_RAM_BANK0267_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0267_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0268_DATA_W                                             32
#define AUX_RAM_BANK0268_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0268_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0269_DATA_W                                             32
#define AUX_RAM_BANK0269_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0269_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0270_DATA_W                                             32
#define AUX_RAM_BANK0270_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0270_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0271_DATA_W                                             32
#define AUX_RAM_BANK0271_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0271_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0272_DATA_W                                             32
#define AUX_RAM_BANK0272_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0272_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0273_DATA_W                                             32
#define AUX_RAM_BANK0273_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0273_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0274_DATA_W                                             32
#define AUX_RAM_BANK0274_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0274_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0275_DATA_W                                             32
#define AUX_RAM_BANK0275_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0275_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0276_DATA_W                                             32
#define AUX_RAM_BANK0276_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0276_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0277_DATA_W                                             32
#define AUX_RAM_BANK0277_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0277_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0278_DATA_W                                             32
#define AUX_RAM_BANK0278_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0278_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0279_DATA_W                                             32
#define AUX_RAM_BANK0279_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0279_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0280_DATA_W                                             32
#define AUX_RAM_BANK0280_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0280_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0281_DATA_W                                             32
#define AUX_RAM_BANK0281_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0281_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0282_DATA_W                                             32
#define AUX_RAM_BANK0282_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0282_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0283_DATA_W                                             32
#define AUX_RAM_BANK0283_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0283_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0284_DATA_W                                             32
#define AUX_RAM_BANK0284_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0284_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0285_DATA_W                                             32
#define AUX_RAM_BANK0285_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0285_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0286_DATA_W                                             32
#define AUX_RAM_BANK0286_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0286_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0287_DATA_W                                             32
#define AUX_RAM_BANK0287_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0287_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0288_DATA_W                                             32
#define AUX_RAM_BANK0288_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0288_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0289_DATA_W                                             32
#define AUX_RAM_BANK0289_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0289_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0290_DATA_W                                             32
#define AUX_RAM_BANK0290_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0290_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0291_DATA_W                                             32
#define AUX_RAM_BANK0291_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0291_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0292_DATA_W                                             32
#define AUX_RAM_BANK0292_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0292_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0293_DATA_W                                             32
#define AUX_RAM_BANK0293_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0293_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0294_DATA_W                                             32
#define AUX_RAM_BANK0294_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0294_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0295_DATA_W                                             32
#define AUX_RAM_BANK0295_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0295_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0296_DATA_W                                             32
#define AUX_RAM_BANK0296_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0296_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0297_DATA_W                                             32
#define AUX_RAM_BANK0297_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0297_DATA_S                                              0

