brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0398_DATA_W                                             32
#define AUX_RAM_BANK0398_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0398_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0399_DATA_W                                             32
#define AUX_RAM_BANK0399_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0399_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0400_DATA_W                                             32
#define AUX_RAM_BANK0400_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0400_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0401_DATA_W                                             32
#define AUX_RAM_BANK0401_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0401_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0402_DATA_W                                             32
#define AUX_RAM_BANK0402_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0402_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0403_DATA_W                                             32
#define AUX_RAM_BANK0403_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0403_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0404_DATA_W                                             32
#define AUX_RAM_BANK0404_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0404_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0405_DATA_W                                             32
#define AUX_RAM_BANK0405_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0405_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0406
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0406_DATA_W                                             32
#define AUX_RAM_BANK0406_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0406_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0407
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0407_DATA_W                                             32
#define AUX_RAM_BANK0407_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0407_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0408
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0408_DATA_W                                             32
#define AUX_RAM_BANK0408_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0408_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0409
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0409_DATA_W                                             32
#define AUX_RAM_BANK0409_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0409_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0410
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0410_DATA_W                                             32
#define AUX_RAM_BANK0410_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0410_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0411
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0411_DATA_W                                             32
#define AUX_RAM_BANK0411_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0411_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0412
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0412_DATA_W                                             32
#define AUX_RAM_BANK0412_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0412_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0413
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0413_DATA_W                                             32
#define AUX_RAM_BANK0413_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0413_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0414
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0414_DATA_W                                             32
#define AUX_RAM_BANK0414_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0414_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0415
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0415_DATA_W                                             32
#define AUX_RAM_BANK0415_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0415_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0416
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0416_DATA_W                                             32
#define AUX_RAM_BANK0416_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0416_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0417
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0417_DATA_W                                             32
#define AUX_RAM_BANK0417_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0417_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0418
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0418_DATA_W                                             32
#define AUX_RAM_BANK0418_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0418_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0419
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0419_DATA_W                                             32
#define AUX_RAM_BANK0419_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0419_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0420
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0420_DATA_W                                             32
#define AUX_RAM_BANK0420_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0420_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0421
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0421_DATA_W                                             32
#define AUX_RAM_BANK0421_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0421_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0422
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0422_DATA_W                                             32
#define AUX_RAM_BANK0422_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0422_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0423
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0423_DATA_W                                             32
#define AUX_RAM_BANK0423_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0423_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0424
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0424_DATA_W                                             32
#define AUX_RAM_BANK0424_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0424_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0425
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0425_DATA_W                                             32
#define AUX_RAM_BANK0425_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0425_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0426
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0426_DATA_W                                             32
#define AUX_RAM_BANK0426_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0426_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0427
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0427_DATA_W                                             32
#define AUX_RAM_BANK0427_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0427_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0428
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0428_DATA_W                                             32
#define AUX_RAM_BANK0428_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0428_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0429
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0429_DATA_W                                             32
#define AUX_RAM_BANK0429_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0429_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0430
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0430_DATA_W                                             32
#define AUX_RAM_BANK0430_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0430_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0431
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0431_DATA_W                                             32
#define AUX_RAM_BANK0431_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0431_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0432
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0432_DATA_W                                             32
#define AUX_RAM_BANK0432_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0432_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0433
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0433_DATA_W                                             32
#define AUX_RAM_BANK0433_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0433_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0434
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0434_DATA_W                                             32
#define AUX_RAM_BANK0434_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0434_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0435
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0435_DATA_W                                             32
#define AUX_RAM_BANK0435_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0435_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0436
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0436_DATA_W                                             32
#define AUX_RAM_BANK0436_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0436_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0437
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0437_DATA_W                                             32
#define AUX_RAM_BANK0437_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0437_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0438
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0438_DATA_W                                             32
#define AUX_RAM_BANK0438_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0438_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0439
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0439_DATA_W                                             32
#define AUX_RAM_BANK0439_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0439_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0440
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0440_DATA_W                                             32
#define AUX_RAM_BANK0440_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0440_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0441
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0441_DATA_W                                             32
#define AUX_RAM_BANK0441_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0441_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0442
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0442_DATA_W                                             32
#define AUX_RAM_BANK0442_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0442_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0443
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0443_DATA_W                                             32
#define AUX_RAM_BANK0443_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0443_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0444
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0444_DATA_W                                             32
#define AUX_RAM_BANK0444_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0444_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0445
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0445_DATA_W                                             32
#define AUX_RAM_BANK0445_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0445_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0446
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0446_DATA_W                                             32
#define AUX_RAM_BANK0446_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0446_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0447
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0447_DATA_W                                             32
#define AUX_RAM_BANK0447_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0447_DATA_S                                              0

