brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0448
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0448_DATA_W                                             32
#define AUX_RAM_BANK0448_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0448_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0449
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0449_DATA_W                                             32
#define AUX_RAM_BANK0449_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0449_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0450
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0450_DATA_W                                             32
#define AUX_RAM_BANK0450_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0450_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0451
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0451_DATA_W                                             32
#define AUX_RAM_BANK0451_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0451_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0452
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0452_DATA_W                                             32
#define AUX_RAM_BANK0452_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0452_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0453
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0453_DATA_W                                             32
#define AUX_RAM_BANK0453_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0453_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0454
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0454_DATA_W                                             32
#define AUX_RAM_BANK0454_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0454_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0455
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0455_DATA_W                                             32
#define AUX_RAM_BANK0455_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0455_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0456
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0456_DATA_W                                             32
#define AUX_RAM_BANK0456_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0456_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0457
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0457_DATA_W                                             32
#define AUX_RAM_BANK0457_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0457_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0458
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0458_DATA_W                                             32
#define AUX_RAM_BANK0458_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0458_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0459
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0459_DATA_W                                             32
#define AUX_RAM_BANK0459_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0459_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0460
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0460_DATA_W                                             32
#define AUX_RAM_BANK0460_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0460_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0461
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0461_DATA_W                                             32
#define AUX_RAM_BANK0461_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0461_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0462
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0462_DATA_W                                             32
#define AUX_RAM_BANK0462_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0462_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0463
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0463_DATA_W                                             32
#define AUX_RAM_BANK0463_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0463_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0464
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0464_DATA_W                                             32
#define AUX_RAM_BANK0464_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0464_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0465
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0465_DATA_W                                             32
#define AUX_RAM_BANK0465_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0465_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0466
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0466_DATA_W                                             32
#define AUX_RAM_BANK0466_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0466_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0467
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0467_DATA_W                                             32
#define AUX_RAM_BANK0467_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0467_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0468
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0468_DATA_W                                             32
#define AUX_RAM_BANK0468_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0468_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0469
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0469_DATA_W                                             32
#define AUX_RAM_BANK0469_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0469_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0470
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0470_DATA_W                                             32
#define AUX_RAM_BANK0470_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0470_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0471
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0471_DATA_W                                             32
#define AUX_RAM_BANK0471_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0471_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0472
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0472_DATA_W                                             32
#define AUX_RAM_BANK0472_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0472_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0473
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0473_DATA_W                                             32
#define AUX_RAM_BANK0473_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0473_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0474
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0474_DATA_W                                             32
#define AUX_RAM_BANK0474_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0474_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0475
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0475_DATA_W                                             32
#define AUX_RAM_BANK0475_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0475_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0476
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0476_DATA_W                                             32
#define AUX_RAM_BANK0476_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0476_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0477
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0477_DATA_W                                             32
#define AUX_RAM_BANK0477_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0477_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0478
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0478_DATA_W                                             32
#define AUX_RAM_BANK0478_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0478_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0479
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0479_DATA_W                                             32
#define AUX_RAM_BANK0479_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0479_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0480
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0480_DATA_W                                             32
#define AUX_RAM_BANK0480_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0480_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0481
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0481_DATA_W                                             32
#define AUX_RAM_BANK0481_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0481_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0482
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0482_DATA_W                                             32
#define AUX_RAM_BANK0482_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0482_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0483
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0483_DATA_W                                             32
#define AUX_RAM_BANK0483_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0483_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0484
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0484_DATA_W                                             32
#define AUX_RAM_BANK0484_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0484_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0485
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0485_DATA_W                                             32
#define AUX_RAM_BANK0485_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0485_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0486
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0486_DATA_W                                             32
#define AUX_RAM_BANK0486_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0486_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0487
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0487_DATA_W                                             32
#define AUX_RAM_BANK0487_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0487_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0488
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0488_DATA_W                                             32
#define AUX_RAM_BANK0488_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0488_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0489
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0489_DATA_W                                             32
#define AUX_RAM_BANK0489_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0489_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0490
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0490_DATA_W                                             32
#define AUX_RAM_BANK0490_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0490_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0491
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0491_DATA_W                                             32
#define AUX_RAM_BANK0491_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0491_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0492
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0492_DATA_W                                             32
#define AUX_RAM_BANK0492_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0492_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0493
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0493_DATA_W                                             32
#define AUX_RAM_BANK0493_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0493_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0494
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0494_DATA_W                                             32
#define AUX_RAM_BANK0494_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0494_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0495
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0495_DATA_W                                             32
#define AUX_RAM_BANK0495_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0495_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0496
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0496_DATA_W                                             32
#define AUX_RAM_BANK0496_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0496_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0497
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0497_DATA_W                                             32
#define AUX_RAM_BANK0497_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0497_DATA_S                                              0

