brianma94/Contiki-ng-Attacks/arch/cpu/cc26x0-cc13x0/lib/cc2640r2-sdk/inc/hw_aux_ram.h
//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0498
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0498_DATA_W                                             32
#define AUX_RAM_BANK0498_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0498_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0499
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0499_DATA_W                                             32
#define AUX_RAM_BANK0499_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0499_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0500
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0500_DATA_W                                             32
#define AUX_RAM_BANK0500_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0500_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0501
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0501_DATA_W                                             32
#define AUX_RAM_BANK0501_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0501_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0502
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0502_DATA_W                                             32
#define AUX_RAM_BANK0502_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0502_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0503
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0503_DATA_W                                             32
#define AUX_RAM_BANK0503_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0503_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0504
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0504_DATA_W                                             32
#define AUX_RAM_BANK0504_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0504_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0505
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0505_DATA_W                                             32
#define AUX_RAM_BANK0505_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0505_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0506_DATA_W                                             32
#define AUX_RAM_BANK0506_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0506_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0507_DATA_W                                             32
#define AUX_RAM_BANK0507_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0507_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0508_DATA_W                                             32
#define AUX_RAM_BANK0508_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0508_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0509_DATA_W                                             32
#define AUX_RAM_BANK0509_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0509_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0510_DATA_W                                             32
#define AUX_RAM_BANK0510_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0510_DATA_S                                              0

//*****************************************************************************
//
// Register: AUX_RAM_O_BANK0511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define AUX_RAM_BANK0511_DATA_W                                             32
#define AUX_RAM_BANK0511_DATA_M                                     0xFFFFFFFF
#define AUX_RAM_BANK0511_DATA_S                                              0


#endif // __AUX_RAM__
